In [32]:
# Dependencies
import requests
import json
import pandas as pd

In [33]:
# URL for GET requests to retrieve Star Wars character data
MedianHomeValueSqf = "/Users/leilei/Desktop/Project1/MedianHomeValuePerSqf_samples.csv"
Inventory_file = "/Users/leilei/Desktop/Project1/InventoryMeasure_zipCode_samples.csv"

In [34]:
# Read and display the CSV with Pandas
MedianHomeValueSqf = pd.read_csv(MedianHomeValueSqf)
MedianHomeValueSqf.head()

,regionid,regionname,city,state,metro,countyname,sizerank,1996-04,1996-05,1996-06,...,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04,2018-05,2018-06
0,91733,77084,Houston,TX,Houston,Harris,8,49.0,50.0,49.0,...,83,84,84,84,84,85,85,85,86,86
1,96027,90046,Los Angeles,CA,Los Angeles-Long Beach-Anaheim,Los Angeles,37,161.0,162.0,162.0,...,847,854,862,867,873,880,882,881,881,881
2,91685,77036,Houston,TX,Houston,Harris,52,44.0,43.0,43.0,...,79,80,80,80,82,84,86,87,87,87
3,91726,77077,Houston,TX,Houston,Harris,72,75.0,76.0,77.0,...,134,134,134,134,134,135,135,135,135,135
4,96015,90034,Los Angeles,CA,Los Angeles-Long Beach-Anaheim,Los Angeles,85,150.0,150.0,150.0,...,782,790,800,811,823,834,838,838,838,839

In [35]:
# Read and display the CSV with Pandas
Inventory_file = pd.read_csv(Inventory_file)
Inventory_file.head()

,regionname,regiontype,city,countyname,metro,statefullname,datatypedescription,2010-01,2010-02,2010-03,...,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04,2018-05,2018-06
0,77084,Zip,Houston,Harris,Houston,Texas,All Homes,611,617,636,...,202,202,209,214,206,190,179,176,174,172
1,90046,Zip,Los Angeles,Los Angeles,Los Angeles-Long Beach-Anaheim,California,All Homes,259,265,275,...,117,118,119,118,123,131,136,135,135,137
2,77036,Zip,Houston,Harris,Houston,Texas,All Homes,175,174,177,...,81,75,76,79,82,83,84,86,86,84
3,77077,Zip,Houston,Harris,Houston,Texas,All Homes,367,361,353,...,265,255,258,258,258,263,269,275,274,265
4,90044,Zip,Los Angeles,Los Angeles,Los Angeles-Long Beach-Anaheim,California,All Homes,150,148,142,...,37,37,39,40,40,42,44,43,41,39

In [36]:
stacked_MedianHomeValueSqf = MedianHomeValueSqf.melt(id_vars=['regionid','regionname','city','state','metro','countyname','sizerank'])

In [37]:
SanDiego_MedianHomeValueSqf=stacked_MedianHomeValueSqf.loc[stacked_MedianHomeValueSqf.city=='San Diego']

In [38]:
SanDiego_MedianHomeValueSqf.head()

,regionid,regionname,city,state,metro,countyname,sizerank,variable,value
8,96667,92126,San Diego,CA,San Diego,San Diego,177,1996-04,104.0
11,96651,92109,San Diego,CA,San Diego,San Diego,220,1996-04,149.0
12,96643,92101,San Diego,CA,San Diego,San Diego,223,1996-04,140.0
24,96646,92104,San Diego,CA,San Diego,San Diego,427,1996-04,101.0
25,96657,92115,San Diego,CA,San Diego,San Diego,428,1996-04,100.0

In [39]:
SanDiego_MedianHomeValueSqf['date'] = pd.to_datetime(SanDiego_MedianHomeValueSqf['variable'])
SanDiego_MedianHomeValueSqf['year'], SanDiego_MedianHomeValueSqf['month'] = SanDiego_MedianHomeValueSqf['date'].dt.year, SanDiego_MedianHomealueSqf['date'].dt.month

/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [40]:
SanDiego_MedianHomeValueSqf.head()

,regionid,regionname,city,state,metro,countyname,sizerank,variable,value,date,year,month
8,96667,92126,San Diego,CA,San Diego,San Diego,177,1996-04,104.0,1996-04-01,1996,4
11,96651,92109,San Diego,CA,San Diego,San Diego,220,1996-04,149.0,1996-04-01,1996,4
12,96643,92101,San Diego,CA,San Diego,San Diego,223,1996-04,140.0,1996-04-01,1996,4
24,96646,92104,San Diego,CA,San Diego,San Diego,427,1996-04,101.0,1996-04-01,1996,4
25,96657,92115,San Diego,CA,San Diego,San Diego,428,1996-04,100.0,1996-04-01,1996,4

In [41]:
Inventory = Inventory_file.melt(id_vars=['regionname','regiontype','city','countyname','metro','statefullname','datatypedescription'])

In [42]:
SanDiego_Inventory=Inventory.loc[Inventory.city=='San Diego']

In [43]:
SanDiego_Inventory.head()

,regionname,regiontype,city,countyname,metro,statefullname,datatypedescription,variable,value
9,92109,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,247
10,92101,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,436
21,92115,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,175
22,92154,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,175
23,92122,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,112

In [44]:
SanDiego_Inventory['date'] = pd.to_datetime(SanDiego_Inventory['variable'])
SanDiego_Inventory['year'], SanDiego_Inventory['month'] = SanDiego_Inventory['date'].dt.year, SanDiego_Inventory['date'].dt.month

/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [45]:
SanDiego_Inventory.head()

,regionname,regiontype,city,countyname,metro,statefullname,datatypedescription,variable,value,date,year,month
9,92109,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,247,2010-01-01,2010,1
10,92101,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,436,2010-01-01,2010,1
21,92115,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,175,2010-01-01,2010,1
22,92154,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,175,2010-01-01,2010,1
23,92122,Zip,San Diego,San Diego,San Diego,California,All Homes,2010-01,112,2010-01-01,2010,1

In [46]:


file1 = "/Users/leilei/Desktop/Project1/estimate_2010.csv"
file2 = "/Users/leilei/Desktop/Project1/estimate_2011.csv"
file3 = "/Users/leilei/Desktop/Project1/estimate_2012.csv"
file4 = "/Users/leilei/Desktop/Project1/estimate_2013.csv"
file5 = "/Users/leilei/Desktop/Project1/estimate_2014.csv"
file6 = "/Users/leilei/Desktop/Project1/estimate_2015.csv"
file7 = "/Users/leilei/Desktop/Project1/estimate_2016.csv"

In [47]:
filenames = [file1,file2,file3,file4,file5,file6,file7]
Population_detail = pd.concat( [ pd.read_csv(f) for f in filenames ])

In [48]:
Population_detail.head()

     ZIP  YEAR     SEX Group - 10 Year  POPULATION
0  92103  2010  Female        10 to 19         565
1  92025  2010  Female        10 to 19        3800
2  92083  2010  Female        10 to 19        2988
3  92145  2010  Female        10 to 19           0
4  92119  2010  Female        10 to 19        1322

In [49]:
Population_Summary = Population_detail.groupby(['ZIP','YEAR']).sum()

In [50]:
Population_Summary.head()

            POPULATION
ZIP   YEAR
91901 2010       17084
      2011       16998
      2012       17148
      2013       17329
      2014       17553

In [51]:
Population_Summary.reset_index()

       ZIP  YEAR  POPULATION
0    91901  2010       17084
1    91901  2011       16998
2    91901  2012       17148
3    91901  2013       17329
4    91901  2014       17553
5    91901  2015       17695
6    91901  2016       17729
7    91902  2010       17005
8    91902  2011       17012
9    91902  2012       17064
10   91902  2013       17263
11   91902  2014       17374
12   91902  2015       17385
13   91902  2016       17353
14   91905  2010        1669
15   91905  2011        1952
16   91905  2012        1986
17   91905  2013        2014
18   91905  2014        2011
19   91905  2015        2042
20   91905  2016        2031
21   91906  2010        5765
22   91906  2011        3613
23   91906  2012        3662
24   91906  2013        3686
25   91906  2014        3725
26   91906  2015        3749
27   91906  2016        3719
28   91910  2010       76153
29   91910  2011       77464
..     ...   ...         ...
761  92173  2015       29038
762  92173  2016       28730
763  92182  2010        2020
764  92182  2011        2034
765  92182  2012        2100
766  92182  2013        2164
767  92182  2014        2231
768  92182  2015        2242
769  92182  2016        2224
770  92259  2010           0
771  92259  2011           0
772  92259  2012           0
773  92259  2013           0
774  92259  2014           0
775  92259  2015           0
776  92259  2016           0
777  92536  2010         365
778  92536  2011         388
779  92536  2012         375
780  92536  2013         394
781  92536  2014         409
782  92536  2015         444
783  92536  2016         441
784  92672  2010        4040
785  92672  2011        3786
786  92672  2012        3878
787  92672  2013        3885
788  92672  2014        3928
789  92672  2015        3973
790  92672  2016        4083

[791 rows x 3 columns]

In [70]:
MortgageRate = "/Users/leilei/Desktop/MortgageRate.xlsx"
MortgageRate = pd.read_excel(MortgageRate)

In [73]:
MortgageRate

           Week  30 years
0    1971-04-02      7.33
1    1971-04-09      7.31
2    1971-04-16      7.31
3    1971-04-23      7.31
4    1971-04-30      7.29
5    1971-05-07      7.38
6    1971-05-14      7.42
7    1971-05-21      7.44
8    1971-05-28      7.46
9    1971-06-04      7.52
10   1971-06-11      7.52
11   1971-06-18      7.54
12   1971-06-25      7.54
13   1971-07-02      7.54
14   1971-07-09      7.54
15   1971-07-16      7.60
16   1971-07-23      7.65
17   1971-07-30      7.69
18   1971-08-06      7.66
19   1971-08-13      7.73
20   1971-08-20      7.71
21   1971-08-27      7.69
22   1971-09-03      7.71
23   1971-09-10      7.67
24   1971-09-17      7.70
25   1971-09-24      7.67
26   1971-10-01      7.67
27   1971-10-08      7.63
28   1971-10-15      7.63
29   1971-10-22      7.58
...         ...       ...
2410 2017-06-08      3.89
2411 2017-06-15      3.91
2412 2017-06-22      3.90
2413 2017-06-29      3.88
2414 2017-07-06      3.96
2415 2017-07-13      4.03
2416 2017-07-20      3.96
2417 2017-07-27      3.92
2418 2017-08-03      3.93
2419 2017-08-10      3.90
2420 2017-08-17      3.89
2421 2017-08-24      3.86
2422 2017-08-31      3.82
2423 2017-09-07      3.78
2424 2017-09-14      3.78
2425 2017-09-21      3.83
2426 2017-09-28      3.83
2427 2017-10-05      3.85
2428 2017-10-12      3.91
2429 2017-10-19      3.88
2430 2017-10-26      3.94
2431 2017-11-02      3.94
2432 2017-11-09      3.90
2433 2017-11-16      3.95
2434 2017-11-22      3.92
2435 2017-11-30      3.90
2436 2017-12-07      3.94
2437 2017-12-14      3.93
2438 2017-12-21      3.94
2439 2017-12-28      3.99

[2440 rows x 2 columns]

In [85]:
MortgageRate['Date'] = MortgageRate['Week'].dt.strftime("%Y-%m")
MortgageRate.head()

        Week  30 years     Date
0 1971-04-02      7.33  1971-04
1 1971-04-09      7.31  1971-04
2 1971-04-16      7.31  1971-04
3 1971-04-23      7.31  1971-04
4 1971-04-30      7.29  1971-04

In [88]:
MortgageRate.groupby(['Date']).mean()

         30 years
Date
1971-04    7.3100
1971-05    7.4250
1971-06    7.5300
1971-07    7.6040
1971-08    7.6975
1971-09    7.6875
1971-10    7.6280
1971-11    7.5500
1971-12    7.4800
1972-01    7.4375
1972-02    7.3250
1972-03    7.2980
1972-04    7.2900
1972-05    7.3725
1972-06    7.3720
1972-07    7.3950
1972-08    7.4000
1972-09    7.4200
1972-10    7.4200
1972-11    7.4275
1972-12    7.4420
1973-01    7.4375
1973-02    7.4400
1973-03    7.4580
1973-04    7.5425
1973-05    7.6525
1973-06    7.7340
1973-07    8.0500
1973-08    8.4960
1973-09    8.8150
...           ...
2015-07    4.0460
2015-08    3.9050
2015-09    3.8900
2015-10    3.7960
2015-11    3.9425
2015-12    3.9640
2016-01    3.8725
2016-02    3.6600
2016-03    3.6940
2016-04    3.6050
2016-05    3.6000
2016-06    3.5680
2016-07    3.4400
2016-08    3.4350
2016-09    3.4600
2016-10    3.4700
2016-11    3.7700
2016-12    4.1980
2017-01    4.1500
2017-02    4.1675
2017-03    4.1960
2017-04    4.0450
2017-05    4.0100
2017-06    3.9040
2017-07    3.9675
2017-08    3.8800
2017-09    3.8050
2017-10    3.8950
2017-11    3.9220
2017-12    3.9500

[561 rows x 1 columns]